# 1965. Employees With Missing Information
[問題](https://leetcode.com/problems/employees-with-missing-information/description/?envType=study-plan-v2&envId=premium-sql-50)

## 解答の方針

outer joinして、isna()を使う。

In [1]:
import pandas as pd

In [2]:
data = [[2, 'Crew'], [4, 'Haven'], [5, 'Kristian']]
employees = pd.DataFrame(data, columns=['employee_id', 'name']).astype({'employee_id':'Int64', 'name':'object'})
data = [[5, 76071], [1, 22517], [4, 63539]]
salaries = pd.DataFrame(data, columns=['employee_id', 'salary']).astype({'employee_id':'Int64', 'salary':'Int64'})

In [3]:
employees

   employee_id      name
0            2      Crew
1            4     Haven
2            5  Kristian

In [4]:
salaries

   employee_id  salary
0            5   76071
1            1   22517
2            4   63539

In [27]:
def find_employees(employees: pd.DataFrame, salaries: pd.DataFrame) -> pd.DataFrame:
    merged = employees.merge(salaries, on="employee_id", how="outer")
    name_nan = merged[merged["name"].isna()].reset_index()
    salary_nan = merged[merged["salary"].isna()].reset_index()
    result = pd.concat([name_nan, salary_nan]).drop_duplicates(subset=["employee_id"]).sort_values(by="employee_id", ascending=True)[["employee_id"]]
    return result

In [28]:
find_employees(employees, salaries)

   employee_id
0            1
0            2

## Test scripts

In [7]:
merged = employees.merge(salaries, on="employee_id", how="outer")

In [8]:
merged

   employee_id      name  salary
0            1       NaN   22517
1            2      Crew    <NA>
2            4     Haven   63539
3            5  Kristian   76071

In [12]:
name_nan = merged[merged["name"].isna()].reset_index()

In [13]:
name_nan

   index  employee_id name  salary
0      0            1  NaN   22517

In [14]:
salary_nan = merged[merged["salary"].isna()].reset_index()

In [20]:
result = pd.concat([name_nan, salary_nan])

In [22]:
result.drop_duplicates(subset=["employee_id", "name", "salary"])

   index  employee_id  name  salary
0      0            1   NaN   22517
0      1            2  Crew    <NA>

In [24]:
result[["employee_id"]].sort_values(by="employee_id", ascending=True)

   employee_id
0            1
0            2